БухЭксп/Reports/CW_ОтчетПоГрузоперевозке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>CW_ОтчетПоГрузоперевозке</Name>
		</Properties>
	</Report>
</MetaDataObject>

БухЭксп/AccumulationRegisters/CW_ДоходыПоГрузоперевозкам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>CW_ДоходыПоГрузоперевозкам</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Всего</Name>
					<Comment>"Всего" в базовой валюте учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>"Сумма" в базовой валюте учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДС</Name>
					<Comment>"НДС" в базовой валюте учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма_Валюта</Name>
					<Comment>"Сумма" в валюте договора</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДС_Валюта</Name>
					<Comment>"НДС" в валюте договора</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Всего_Валюта</Name>
					<Comment>"Всего" в валюте договора</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПК_Всего</Name>
					<Comment>Результат корректировки: "Всего" в базовой валюте учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПК_Сумма</Name>
					<Comment>Результат корректировки: "Сумма" в базовой валюте учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПК_НДС</Name>
					<Comment>Результат корректировки: "Всего" в базовой валюте учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Грузоперевозка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Грузоперевозки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Контрагенты</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ДоговорыПоГрузоперевозкам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриложениеКДоговору</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПриложенияКДоговорам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументДоходов</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CW_ДоходыПоГрузоперевозке</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументРасходов</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CW_РасходыПоГрузоперевозке</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПорядокОтражения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_ПорядокОтраженияДоходов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_СтавкаНДС</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Номенклатура</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяЗатрат</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_СтатьяЗатрат</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Валюты</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭтоСчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭтоАкт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Счет</Name>
					<Comment>Актируемый счёт</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.CW_ДоходыПоГрузоперевозке</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПрочиеДоходы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрочиеДоходыИРасходы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РеестрыНДС0Приложение</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_РеестрыНДС0Приложения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяБюджета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПлановыеСтатьиЗатратИДоходов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

БухЭксп/AccumulationRegisters/CW_РасходыПоГрузоперевозкам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>CW_РасходыПоГрузоперевозкам</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Всего</Name>
					<Comment>"Всего" в базовой валюте учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>"Сумма" в базовой валюте учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДС</Name>
					<Comment>"НДС" в базовой валюте учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма_Валюта</Name>
					<Comment>"Сумма" в валюте договора</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДС_Валюта</Name>
					<Comment>"НДС" в валюте договора</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Всего_Валюта</Name>
					<Comment>"Всего" в валюте договора</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПК_Всего</Name>
					<Comment>Результат корректировки: "Всего" в базовой валюте учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПК_Сумма</Name>
					<Comment>Результат корректировки: "Сумма" в базовой валюте учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПК_НДС</Name>
					<Comment>Результат корректировки: "НДС" в базовой валюте учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Грузоперевозка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Грузоперевозки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Контрагенты</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ДоговорыПоГрузоперевозкам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриложениеКДоговору</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПриложенияКДоговорам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументРасходов</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CW_РасходыПоГрузоперевозке</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПорядокОтражения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_ПорядокОтраженияЗатрат</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_СтавкаНДС</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Номенклатура</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяЗатрат</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_СтатьяЗатрат</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Валюты</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Покупатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорПокупателя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ДоговорыПоГрузоперевозкам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриложениеКДоговоруПокупателя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПриложенияКДоговорам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭтоСчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭтоАкт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CW_РасходыПоГрузоперевозке</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПрочиеРасходы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрочиеДоходыИРасходы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяБюджета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПлановыеСтатьиЗатратИДоходов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

БухЭксп/Enums/CW_ПорядокОтраженияДоходов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_ПорядокОтраженияДоходов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Перевыставление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СобственнаяУслуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеревыставлениеПоСтавкам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеДоходы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Enums/CW_ПорядокОтраженияЗатрат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_ПорядокОтраженияЗатрат</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Перевыставление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Затраты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеревыставлениеПоСтавкам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеРасходы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Reports/CW_ОтчетПоГрузоперевозке/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Грузоперевозки", Грузоперевозки) Тогда
		СформироватьПриОткрытии = Истина;
	КонецЕсли; 
	ОтображениеФинРез = CW_Настройки.ПолучитьНастройкуПользователя(CW_Настройки.Пользователь(), "ОтображениеФинРез");
	ИсключатьВнутрихолдинговыеВзаиморасчеты = CW_Настройки.ПолучитьНастройкуПользователя(CW_Настройки.Пользователь(), "ИсключатьВнутрихолдинговыеВзаиморасчеты");
	
	ВРУ = Константы.ВалютаРегламентированногоУчета.Получить();
	
	//Работа с буфером обмена
	// Проверка буфера обмена на наличие скопированных строк
	УстановитьДоступностьКомандыВставки(ЭтотОбъект, Не CW_РаботаСБуферомОбмена.ПустойБуферОбмена());
	//Работа с буфером обмена   
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.ФормаНастройка.Пометка = Истина;
	
	Если СформироватьПриОткрытии Тогда
		СформироватьПриОткрытии = Ложь;
		_Настройка();
		//ФормированиеОтчета = 0;
		ВыводЗадолженности = 0;
		Организация = ПредопределенноеЗначение("Справочник.Организации.ПустаяСсылка");
		_СформироватьОтчет();
	Иначе
		_ВосстановитьСеансовуюНастройку();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	//_СохранитьСеансовуюНастройку();
	
КонецПроцедуры

// --- 

&НаКлиенте
Процедура Настройка(Команда)
	
	_Настройка(); 
	
КонецПроцедуры

&НаСервере
Процедура _Настройка(Скрыть=Ложь)
	
	Если Скрыть Тогда
		Элементы.ГруппаНастройкиОтчета.Видимость = Ложь;
		Элементы.ФормаНастройка.Пометка=Ложь;
	Иначе
		Если Элементы.ГруппаНастройкиОтчета.Видимость Тогда
			Элементы.ГруппаНастройкиОтчета.Видимость = Ложь;
			Элементы.ФормаНастройка.Пометка=Ложь;
		Иначе
			Элементы.ГруппаНастройкиОтчета.Видимость = Истина;
			Элементы.ФормаНастройка.Пометка=Истина;
		КонецЕсли; 
	КонецЕсли; 
		
КонецПроцедуры

// ---

&НаКлиенте
Процедура ГрузоперевозкиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	// ---
	ПОВ = Новый ОписаниеОповещения("ОбработкаДобавленияГрузоперевозки",ЭтотОбъект); 
	ПФ = Новый Структура("МножественныйВыбор,РежимВыбора",Истина,Истина);
	ОткрытьФорму("Справочник.CW_Грузоперевозки.ФормаВыбора",ПФ,,,,,ПОВ, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаДобавленияГрузоперевозки(Ответ, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если Ответ <> Неопределено Тогда
		Для каждого ГП Из Ответ Цикл
			Грузоперевозки.Добавить(ГП);	
		КонецЦикла; 
	КонецЕсли; 
	
	// --- 
КонецПроцедуры
  

// ---

&НаСервере
Процедура _ВосстановитьСеансовуюНастройку()
	
	// пытаемся восстановить настройки
	Идентификатор = РеквизитФормыВЗначение("Отчет").Метаданные().Имя;
	СеансоваяНастройка = ХранилищеСистемныхНастроек.Загрузить(Идентификатор, "Сеансовая");
	Если СеансоваяНастройка <> Неопределено Тогда
		Попытка
			СеансоваяНастройка.Свойство("Организация", Организация);
			СеансоваяНастройка.Свойство("ФормированиеОтчета", ОтображениеФинРез);
			СеансоваяНастройка.Свойство("ПорядокОтражения", ПорядокОтражения);
			СеансоваяНастройка.Свойство("ВыводЗадолженности", ВыводЗадолженности);
			//СеансоваяНастройка.Свойство("Грузоперевозки", Грузоперевозки);
		Исключение
		КонецПопытки; 
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура _СохранитьСеансовуюНастройку()
	
	СтруктураНастройки = Новый Структура();
	СтруктураНастройки.Вставить("Организация", Организация);
	СтруктураНастройки.Вставить("ФормированиеОтчета", ОтображениеФинРез);
	СтруктураНастройки.Вставить("ПорядокОтражения", ПорядокОтражения);
	СтруктураНастройки.Вставить("ВыводЗадолженности", ВыводЗадолженности);
	//СтруктураНастройки.Вставить("Грузоперевозки", Грузоперевозки);
	
	Идентификатор = РеквизитФормыВЗначение("Отчет").Метаданные().Имя;
	ХранилищеСистемныхНастроек.Сохранить(Идентификатор, "Сеансовая", СтруктураНастройки);
	
	
КонецПроцедуры

// ---

&НаКлиенте
Процедура Сформировать(Команда)
	
	_Настройка(Истина);
	_СформироватьОтчет();
	
КонецПроцедуры

&НаСервере
Процедура _СформироватьОтчет()
	
	CW_ВалютаРегламентированногоУчетаРубль = ПолучитьФункциональнуюОпцию("CW_ВалютаРегламентированногоУчетаРубль");
	Если не CW_ВалютаРегламентированногоУчетаРубль тогда
		ОтображениеФинРез = 1;
	КонецЕсли;

	
	ТаблДок = Новый ТабличныйДокумент;	
	МакетОтчета = РеквизитФормыВЗначение("Отчет").ПолучитьМакет("Отчет");
	
	// Заголовок
	Область = МакетОтчета.ПолучитьОбласть("Заголовок");
	Область.Параметры.Заголовок = ВРег("Отчёт по грузоперевозкам");
	Область.Параметры.Фильтр = "Грузоперевозки: "+_сф.сп_Представление(Грузоперевозки, ",", Ложь) + " " + ?(ОтображениеФинРез = 0, "(по актам)", "(по счетам)");
	ТаблДок.Вывести(Область);
	
	// Входящие документы
	ТЗ_В = ПолучитьВходящие();
			
	Область = МакетОтчета.ПолучитьОбласть("Шапка"); 
	Область.Параметры.ЗаголовокТаблицы 	= "Входящие документы";
	Область.параметры.ВРУ 				= Строка(ВРУ);
	ТаблДок.Вывести(Область);
	
	Долг = 0;
	Для Каждого Стр из ТЗ_В Цикл
		Область = МакетОтчета.ПолучитьОбласть("Строка");
		Область.Параметры.Заполнить(Стр);
		Область.Параметры.ПредставлениеДокумента = ?(ОтображениеФинРез = 1, "Счет №" + Стр.Документ.НомерСчета + " от " + Формат(Стр.Документ.ДатаСчета, "ДЛФ=Д"), Стр.ПредставлениеДокумента);
		Область.Параметры.Задолженность = Задолженность(Стр.Документ);
		// --- 		
		ВТД = Новый ТабличныйДокумент;
		ВТД.Вывести(Область);
		Если (Область.Параметры.Задолженность > 0) Тогда
			
			ЯчейкаЗадолженности = ВТД.Область("R1C9");
			ЯчейкаЗадолженности.ЦветФона = WebЦвета.ЛососьСветлый;
	
		КонецЕсли; 
		// --- 
		Долг = Долг + Область.Параметры.Задолженность;
		ТаблДок.Вывести(ВТД);	
	КонецЦикла;	
	
	ТЗ_ = ТЗ_В.Скопировать();
	ТЗ_.Свернуть("Валюта");
	
	Область = МакетОтчета.ПолучитьОбласть("Итого");
	Область.Параметры.ВсегоВалОборот = ?(ТЗ_.Количество() = 1, ТЗ_В.Итог("ВсегоВалОборот"), " Х ");
	Область.Параметры.ВсегоОборот    = ТЗ_В.Итог("ВсегоОборот");
	Область.Параметры.СуммаОборот    = ТЗ_В.Итог("СуммаОборот");
	Область.Параметры.НДСОборот      = ТЗ_В.Итог("НДСОборот");
	Область.Параметры.Задолженность  = ?(ТЗ_.Количество() = 1, Долг, " Х ");
	ТаблДок.Вывести(Область);
	
	// Исходящие документы
	ТЗ_И = ПолучитьИсходящие();
			
	Область = МакетОтчета.ПолучитьОбласть("Шапка"); 
	Область.Параметры.ЗаголовокТаблицы = "Исходящие документы";
	ТаблДок.Вывести(Область);
	
	Долг = 0;
	Для Каждого Стр из ТЗ_И Цикл
		Область = МакетОтчета.ПолучитьОбласть("Строка");
		Область.Параметры.Заполнить(Стр); 
		Область.Параметры.ПредставлениеДокумента = ?(ОтображениеФинРез = 1, "Счет №" + Стр.Документ.НомерСчета + " от " + Формат(Стр.Документ.ДатаСчета, "ДЛФ=Д"), Стр.ПредставлениеДокумента);
		Область.Параметры.Задолженность = Задолженность(Стр.Документ);
		// --- 		
		ВТД = Новый ТабличныйДокумент;
		ВТД.Вывести(Область);
		Если (Область.Параметры.Задолженность > 0) Тогда
			
			ЯчейкаЗадолженности = ВТД.Область("R1C9");
			ЯчейкаЗадолженности.ЦветФона = WebЦвета.ЛососьСветлый;
	
		КонецЕсли; 
		// --- 
		Долг = Долг + Область.Параметры.Задолженность;
		ТаблДок.Вывести(ВТД);	
	КонецЦикла;	
	
	ТЗ_ = ТЗ_И.Скопировать();
	ТЗ_.Свернуть("Валюта");
	
	Область = МакетОтчета.ПолучитьОбласть("Итого");
	Область.Параметры.ВсегоВалОборот = ?(ТЗ_.Количество() = 1, ТЗ_И.Итог("ВсегоВалОборот"), " Х ");
	Область.Параметры.ВсегоОборот = ТЗ_И.Итог("ВсегоОборот");
	Область.Параметры.СуммаОборот = ТЗ_И.Итог("СуммаОборот");
	Область.Параметры.НДСОборот   = ТЗ_И.Итог("НДСОборот");
	Область.Параметры.Задолженность  = ?(ТЗ_.Количество() = 1, Долг, " Х ");	
	ТаблДок.Вывести(Область);		
	
	// Подвал
	Область = МакетОтчета.ПолучитьОбласть("Подвал");
	Область.Параметры.ПрибыльСНДС   = ТЗ_И.Итог("ВсегоОборот") - ТЗ_В.Итог("ВсегоОборот");
	Область.Параметры.ПрибыльБезНДС = ТЗ_И.Итог("СуммаОборот") - ТЗ_В.Итог("СуммаОборот");
	Область.Параметры.ВРУ 			= Строка(ВРУ);
	ТаблДок.Вывести(Область);
	
	CW_Отчеты.ЗаменитьТекстВТаблицеРезультата(ТаблДок, " Х ", "Х", ГоризонтальноеПоложение.Центр);	
	Если Область.Параметры.ПрибыльСНДС < 0 ИЛИ Область.Параметры.ПрибыльБезНДС < 0 Тогда
		ТаблДок.Область("R" + Строка(14 + ТЗ_И.Количество() + ТЗ_В.Количество()) + "C2").ЦветТекста = WebЦвета.Красный;	
	КонецЕсли;	
	
	
	// Покажем
	Результат = ТаблДок;
	Результат.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	Результат.АвтоМасштаб = Истина;
	
	// --- 
	_СохранитьСеансовуюНастройку();
	
КонецПроцедуры

// ---

&НаСервере
Функция ПолучитьИсходящие()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	CW_ДоходыПоГрузоперевозкам.Контрагент КАК Контрагент,
		|	CW_ДоходыПоГрузоперевозкам.ДокументДоходов КАК Документ,
		|	CW_ДоходыПоГрузоперевозкам.ДокументДоходов.ПредставлениеДокумента КАК ПредставлениеДокумента,
		|	CW_ДоходыПоГрузоперевозкам.Валюта КАК Валюта,
		|	CW_ДоходыПоГрузоперевозкеУслуги.ПорядокОтражения КАК ПорядокОтражения,
		|	СУММА(CW_ДоходыПоГрузоперевозкам.Всего) КАК Всего,
		|	СУММА(CW_ДоходыПоГрузоперевозкам.Сумма) КАК Сумма,
		|	СУММА(CW_ДоходыПоГрузоперевозкам.НДС) КАК НДС,
		|	СУММА(CW_ДоходыПоГрузоперевозкам.Всего_Валюта) КАК Всего_Валюта,
		|	CW_ДоходыПоГрузоперевозкам.Грузоперевозка КАК Грузоперевозка
		|ПОМЕСТИТЬ Доходы
		|ИЗ
		|	РегистрНакопления.CW_ДоходыПоГрузоперевозкам КАК CW_ДоходыПоГрузоперевозкам
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.CW_ДоходыПоГрузоперевозке.Услуги КАК CW_ДоходыПоГрузоперевозкеУслуги
		|		ПО CW_ДоходыПоГрузоперевозкам.ДокументДоходов = CW_ДоходыПоГрузоперевозкеУслуги.Ссылка
		|			И CW_ДоходыПоГрузоперевозкам.НомерСтроки = CW_ДоходыПоГрузоперевозкеУслуги.НомерСтроки
		|ГДЕ
		|	CW_ДоходыПоГрузоперевозкам.Грузоперевозка В(&Грузоперевозки)
		|	И ВЫБОР
		|			КОГДА &Организация <> НЕОПРЕДЕЛЕНО
		|				ТОГДА CW_ДоходыПоГрузоперевозкам.ДокументДоходов.Организация = &Организация
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|	И ВЫБОР
		|			КОГДА &ОтображениеФинРез = 0
		|				ТОГДА CW_ДоходыПоГрузоперевозкам.ДокументДоходов.ФормируетсяАкт
		|						ИЛИ CW_ДоходыПоГрузоперевозкам.ДокументДоходов.ФормируетсяСчетФактура
		|			ИНАЧЕ CW_ДоходыПоГрузоперевозкам.ДокументДоходов.ФормируетсяСчет
		|		КОНЕЦ
		|
		|СГРУППИРОВАТЬ ПО
		|	CW_ДоходыПоГрузоперевозкам.Контрагент,
		|	CW_ДоходыПоГрузоперевозкам.Валюта,
		|	CW_ДоходыПоГрузоперевозкам.ДокументДоходов,
		|	CW_ДоходыПоГрузоперевозкам.ДокументДоходов.ПредставлениеДокумента,
		|	CW_ДоходыПоГрузоперевозкеУслуги.ПорядокОтражения,
		|	CW_ДоходыПоГрузоперевозкам.Грузоперевозка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Доходы.Контрагент КАК Контрагент,
		|	Доходы.Документ КАК Документ,
		|	Доходы.Валюта КАК Валюта,
		|	СУММА(Доходы.Всего) КАК Всего,
		|	СУММА(Доходы.Сумма) КАК Сумма,
		|	СУММА(Доходы.НДС) КАК НДС,
		|	СУММА(Доходы.Всего_Валюта) КАК Всего_Валюта
		|ПОМЕСТИТЬ ОтобранныеДоходы
		|ИЗ
		|	Доходы КАК Доходы
		|ГДЕ
		|	//УсловиеПорядокОтражения 
		|
		|СГРУППИРОВАТЬ ПО
		|	Доходы.Контрагент,
		|	Доходы.Документ,
		|	Доходы.Валюта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОтобранныеДоходы.Контрагент КАК Контрагент,
		|	ОтобранныеДоходы.Документ КАК Документ,
		|	ОтобранныеДоходы.Валюта КАК Валюта,
		|	ОтобранныеДоходы.Всего КАК ВсегоОборот,
		|	ОтобранныеДоходы.Сумма КАК СуммаОборот,
		|	ОтобранныеДоходы.НДС КАК НДСОборот,
		|	ОтобранныеДоходы.Всего_Валюта КАК ВсегоВалОборот
		|ИЗ
		|	ОтобранныеДоходы КАК ОтобранныеДоходы
		|
		|УПОРЯДОЧИТЬ ПО
		|	ОтобранныеДоходы.Документ.Дата";

	Запрос.УстановитьПараметр("Грузоперевозки", Грузоперевозки);
	Запрос.УстановитьПараметр("Организация", ?(Организация.Пустая(), Неопределено, Организация));
	Запрос.УстановитьПараметр("ОтображениеФинРез", ОтображениеФинРез);
	
	Если ПорядокОтражения = 0 Тогда
		
		УсловиеПорядокОтражения = "ИСТИНА";
		
	ИначеЕсли ПорядокОтражения = 1 Тогда 
		
		УсловиеПорядокОтражения = "Доходы.ПорядокОтражения В (&ПорядокОтраженияДоходов)";

		ПорядокОтраженияДоходов = Новый Массив;
		ПорядокОтраженияДоходов.Добавить(ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияДоходов.СобственнаяУслуга"));
		ПорядокОтраженияДоходов.Добавить(ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияДоходов.ПрочиеДоходы"));
		
		Запрос.УстановитьПараметр("ПорядокОтраженияДоходов", ПорядокОтраженияДоходов);
		
	ИначеЕсли ПорядокОтражения = 2 Тогда
		
		УсловиеПорядокОтражения = "Доходы.ПорядокОтражения В (&ПорядокОтраженияДоходов)";
		
		ПорядокОтраженияДоходов = Новый Массив;
		ПорядокОтраженияДоходов.Добавить(ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияДоходов.Перевыставление"));
		
		Запрос.УстановитьПараметр("ПорядокОтраженияДоходов", ПорядокОтраженияДоходов);
		
	КонецЕсли; 
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "//УсловиеПорядокОтражения", УсловиеПорядокОтражения);
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Если (ИсключатьВнутрихолдинговыеВзаиморасчеты) Тогда
		
		МассивХолдинговыхКонтрагентов = CW_Финансы.ПолучитьКонтрагентовХолдинга();
		Если (МассивХолдинговыхКонтрагентов.Количество() <> 0) Тогда
			МассивУдаляемых = Новый Массив;
			Для каждого Стр Из ТЗ Цикл
				
				Если (МассивХолдинговыхКонтрагентов.Найти(Стр.Контрагент) <> Неопределено) Тогда
					МассивУдаляемых.Добавить(Стр);
				КонецЕсли; 
				
			КонецЦикла; 
			_сф.к_УдалитьЭлементыПоМассиву(ТЗ,МассивУдаляемых);
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	ТЗ.Колонки.Добавить("ЕстьОригиналы");
	ТЗ.Колонки.Добавить("ПредставлениеДокумента");
	Для каждого Стр Из ТЗ Цикл
		
		СтруктураКонтроляОригиналов =  CW_Документы.ПолучитьПризнакНаличияИДатуВозвратаОригиналов(Стр.Документ);
		Признак 	= СтруктураКонтроляОригиналов.ОригиналыПредоставлены;
		
		Стр.ЕстьОригиналы = ?(Признак,"+","-");
		Стр.ПредставлениеДокумента = Стр.Документ.ПредставлениеДокумента;
		
	КонецЦикла;
	
	Возврат ТЗ;
	
КонецФункции	

&НаСервере
Функция ПолучитьВходящие()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	CW_РасходыПоГрузоперевозкам.Контрагент КАК Контрагент,
		|	CW_РасходыПоГрузоперевозкам.ДокументРасходов КАК Документ,
		|	CW_РасходыПоГрузоперевозкам.ДокументРасходов.ПредставлениеДокумента КАК ПредставлениеДокумента,
		|	CW_РасходыПоГрузоперевозкам.Валюта КАК Валюта,
		|	CW_РасходыПоГрузоперевозкеУслуги.ПорядокОтражения КАК ПорядокОтражения,
		|	СУММА(CW_РасходыПоГрузоперевозкам.Всего) КАК Всего,
		|	СУММА(CW_РасходыПоГрузоперевозкам.Сумма) КАК Сумма,
		|	СУММА(CW_РасходыПоГрузоперевозкам.НДС) КАК НДС,
		|	СУММА(CW_РасходыПоГрузоперевозкам.Всего_Валюта) КАК Всего_Валюта,
		|	CW_РасходыПоГрузоперевозкам.Грузоперевозка КАК Грузоперевозка
		|ПОМЕСТИТЬ Расходы
		|ИЗ
		|	РегистрНакопления.CW_РасходыПоГрузоперевозкам КАК CW_РасходыПоГрузоперевозкам
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.CW_РасходыПоГрузоперевозке.Услуги КАК CW_РасходыПоГрузоперевозкеУслуги
		|		ПО CW_РасходыПоГрузоперевозкам.ДокументРасходов = CW_РасходыПоГрузоперевозкеУслуги.Ссылка
		|			И CW_РасходыПоГрузоперевозкам.НомерСтроки = CW_РасходыПоГрузоперевозкеУслуги.НомерСтроки
		|ГДЕ
		|	CW_РасходыПоГрузоперевозкам.Грузоперевозка В(&Грузоперевозки)
		|	И ВЫБОР
		|			КОГДА &Организация <> НЕОПРЕДЕЛЕНО
		|				ТОГДА CW_РасходыПоГрузоперевозкам.ДокументРасходов.Организация = &Организация
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|	И ВЫБОР
		|			КОГДА &ОтображениеФинРез = 0
		|				ТОГДА CW_РасходыПоГрузоперевозкам.ДокументРасходов.ПредъявленАкт
		|						ИЛИ CW_РасходыПоГрузоперевозкам.ДокументРасходов.ПредъявленСФ
		|			ИНАЧЕ CW_РасходыПоГрузоперевозкам.ДокументРасходов.ПредъявленСчет
		|		КОНЕЦ
		|
		|СГРУППИРОВАТЬ ПО
		|	CW_РасходыПоГрузоперевозкам.Контрагент,
		|	CW_РасходыПоГрузоперевозкам.Валюта,
		|	CW_РасходыПоГрузоперевозкам.ДокументРасходов,
		|	CW_РасходыПоГрузоперевозкам.ДокументРасходов.ПредставлениеДокумента,
		|	CW_РасходыПоГрузоперевозкеУслуги.ПорядокОтражения,
		|	CW_РасходыПоГрузоперевозкам.Грузоперевозка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Расходы.Контрагент КАК Контрагент,
		|	Расходы.Документ КАК Документ,
		|	Расходы.Валюта КАК Валюта,
		|	СУММА(Расходы.Всего) КАК Всего,
		|	СУММА(Расходы.Сумма) КАК Сумма,
		|	СУММА(Расходы.НДС) КАК НДС,
		|	СУММА(Расходы.Всего_Валюта) КАК Всего_Валюта
		|ПОМЕСТИТЬ ОтобранныеРасходы
		|ИЗ
		|	Расходы КАК Расходы
		|ГДЕ
		|	//УсловиеПорядокОтражения  
		|
		|СГРУППИРОВАТЬ ПО
		|	Расходы.Контрагент,
		|	Расходы.Документ,
		|	Расходы.Валюта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОтобранныеРасходы.Контрагент КАК Контрагент,
		|	ОтобранныеРасходы.Документ КАК Документ,
		|	ОтобранныеРасходы.Валюта КАК Валюта,
		|	ОтобранныеРасходы.Всего КАК ВсегоОборот,
		|	ОтобранныеРасходы.Сумма КАК СуммаОборот,
		|	ОтобранныеРасходы.НДС КАК НДСОборот,
		|	ОтобранныеРасходы.Всего_Валюта КАК ВсегоВалОборот
		|ИЗ
		|	ОтобранныеРасходы КАК ОтобранныеРасходы
		|
		|УПОРЯДОЧИТЬ ПО
		|	ОтобранныеРасходы.Документ.Дата";

	Запрос.УстановитьПараметр("Грузоперевозки", 	Грузоперевозки);
	Запрос.УстановитьПараметр("Организация", 		?(Организация.Пустая(), Неопределено, Организация));
	Запрос.УстановитьПараметр("ОтображениеФинРез", 	ОтображениеФинРез);
	
	Если ПорядокОтражения = 0 Тогда
		
		УсловиеПорядокОтражения = "ИСТИНА";
		
	ИначеЕсли ПорядокОтражения = 1 Тогда 
		
		УсловиеПорядокОтражения = "Расходы.ПорядокОтражения В (&ПорядокОтраженияРасходов)";

		
		ПорядокОтраженияРасходов = Новый Массив;
		ПорядокОтраженияРасходов.Добавить(ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияЗатрат.Затраты"));
		ПорядокОтраженияРасходов.Добавить(ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияЗатрат.ПрочиеРасходы"));
		
		Запрос.УстановитьПараметр("ПорядокОтраженияРасходов", ПорядокОтраженияРасходов);
		
	ИначеЕсли ПорядокОтражения = 2 Тогда
		
		УсловиеПорядокОтражения = "Расходы.ПорядокОтражения В (&ПорядокОтраженияРасходов)";
	
		ПорядокОтраженияРасходов = Новый Массив;
		ПорядокОтраженияРасходов.Добавить(ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияЗатрат.Перевыставление"));
		
		Запрос.УстановитьПараметр("ПорядокОтраженияРасходов", ПорядокОтраженияРасходов);
		
	КонецЕсли;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "//УсловиеПорядокОтражения", УсловиеПорядокОтражения);
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Если (ИсключатьВнутрихолдинговыеВзаиморасчеты) Тогда
		
		МассивХолдинговыхКонтрагентов = CW_Финансы.ПолучитьКонтрагентовХолдинга();
		Если (МассивХолдинговыхКонтрагентов.Количество() <> 0) Тогда
			МассивУдаляемых = Новый Массив;
			Для каждого Стр Из ТЗ Цикл
				
				Если (МассивХолдинговыхКонтрагентов.Найти(Стр.Контрагент) <> Неопределено) Тогда
					МассивУдаляемых.Добавить(Стр);
				КонецЕсли; 
				
			КонецЦикла; 
			_сф.к_УдалитьЭлементыПоМассиву(ТЗ,МассивУдаляемых);
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	ТЗ.Колонки.Добавить("ЕстьОригиналы");
	ТЗ.Колонки.Добавить("ПредставлениеДокумента");
	Для каждого Стр Из ТЗ Цикл
		
		СтруктураКонтроляОригиналов =  CW_Документы.ПолучитьПризнакНаличияИДатуВозвратаОригиналов(Стр.Документ);
		Признак 	= СтруктураКонтроляОригиналов.ОригиналыПредоставлены;
		
		Стр.ЕстьОригиналы = ?(Признак,"+","-");
		Стр.ПредставлениеДокумента = Стр.Документ.ПредставлениеДокумента;
		
	КонецЦикла;
	
	Возврат ТЗ;
	
КонецФункции	

&НаСервере
Функция Задолженность(Док)
	
	Если ОтображениеФинРез = 0 Тогда
		массСчетаВзаиморасчетов = Новый Массив();
		Если ТипЗнч(Док) = Тип("ДокументСсылка.CW_РасходыПоГрузоперевозке") Тогда
			Если НЕ ЗначениеЗаполнено(Док.ВедомыйДокумент) Тогда
				Возврат 0;
			КонецЕсли;
			// счет можно взять из ведомого документа
			массСчетаВзаиморасчетов.Добавить(Док.ВедомыйДокумент.СчетУчетаРасчетовСКонтрагентом);
			знакОстатка = -1; // кредитовый
			
		ИначеЕсли ТипЗнч(док) = Тип("ДокументСсылка.CW_ДоходыПоГрузоперевозке") Тогда
			Если НЕ ЗначениеЗаполнено(Док.ВедомыйДокумент) Тогда
				Возврат 0;
			КонецЕсли;
			// счет расчетов с покупателями - всегда 62.01, но может быть и другой, если он задан в уч.политике
			Счета = CW_Конфигурация.ПланСчетов(); 
			массСчетаВзаиморасчетов.Добавить(Счета.РасчетыСПокупателями);
			массСчетаВзаиморасчетов.Добавить(Счета.РасчетыСПокупателямиВал);
			массСчетаВзаиморасчетов.Добавить(Счета.РасчетыСПокупателямиУЕ);

			сч = CW_Настройки.ПараметрУчетнойПолитики(Док.Дата, Док.Организация, "СчетРасчетов_Клиенты_Рубли");
			Если ЗначениеЗаполнено(сч) И (Неопределено = массСчетаВзаиморасчетов.Найти(сч)) Тогда
				массСчетаВзаиморасчетов.Добавить(сч);
			КонецЕсли;
			сч = CW_Настройки.ПараметрУчетнойПолитики(Док.Дата, Док.Организация, "СчетРасчетов_Клиенты_Валюта");
			Если ЗначениеЗаполнено(сч) И (Неопределено = массСчетаВзаиморасчетов.Найти(сч)) Тогда
				массСчетаВзаиморасчетов.Добавить(сч);
			КонецЕсли;
			знакОстатка = 1; // дебетовый
			
		Иначе
			Сообщить("Не поддерживается расчет задолженности для документов " + Док);
			Возврат "?";
		КонецЕсли;
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("Договор", 			док.Договор);
		СтруктураПараметров.Вставить("ПриложениеКДоговору",	док.ПриложениеКДоговору);
		
		УчетныйДоговор = CW_Финансы.ПолучитьУчетныйДоговор(СтруктураПараметров);
		
		// все счета должны иметь данный набор субконто (здесь не проверяем)
		массВидыСубконто = Новый Массив();
		ВидыСубконто = CW_Конфигурация.ВидыСубконто();
		массВидыСубконто.Добавить(ВидыСубконто.Контрагенты);
		массВидыСубконто.Добавить(ВидыСубконто.Договоры);
		массВидыСубконто.Добавить(ВидыСубконто.ДокументыРасчетовСКонтрагентами);
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ХозрасчетныйОстатки.Счет.Валютный
		|			ТОГДА ХозрасчетныйОстатки.ВалютнаяСуммаОстаток
		|		ИНАЧЕ ХозрасчетныйОстатки.СуммаОстаток
		|	КОНЕЦ КАК СуммаОстаток
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.Остатки(
		|			,
		|			Счет В (&массСчетаВзаиморасчетов),
		|			&массВидыСубконто,
		|			Организация = &Организация
		|				И Субконто1 = &Контрагент
		|				И Субконто2 = &Договор
		|				И Субконто3 = &ДокументРасчетов) КАК ХозрасчетныйОстатки"
		); 

		Запрос.УстановитьПараметр("массСчетаВзаиморасчетов", массСчетаВзаиморасчетов);
		Запрос.УстановитьПараметр("массВидыСубконто", массВидыСубконто);
		Запрос.УстановитьПараметр("Организация", док.Организация);
		Запрос.УстановитьПараметр("Контрагент", док.Контрагент);
		Запрос.УстановитьПараметр("Договор", 	УчетныйДоговор);
		Запрос.УстановитьПараметр("ДокументРасчетов", док.ВедомыйДокумент);
		Рез = Запрос.Выполнить().Выбрать();
		Если НЕ Рез.Следующий() Тогда
			Возврат 0;
		КонецЕсли;
		
		сум = Рез.СуммаОстаток * знакОстатка;
		
	ИначеЕсли ОтображениеФинРез = 1 Тогда
		
		Если ТипЗнч(Док) = Тип("ДокументСсылка.CW_РасходыПоГрузоперевозке") Тогда
			Запрос = Новый Запрос;
			Запрос.Текст =
				"ВЫБРАТЬ
				|	CW_ОперативнаяКредиторскаяЗадолженностьОстатки.Всего_ВалютаОстаток
				|ИЗ
				|	РегистрНакопления.CW_ОперативнаяКредиторскаяЗадолженность.Остатки(, Счет = &Док) КАК CW_ОперативнаяКредиторскаяЗадолженностьОстатки";
			Запрос.УстановитьПараметр("НаДату", Док.Дата); 	
			Запрос.УстановитьПараметр("Док", Док);
			Рез = Запрос.Выполнить().Выбрать();
			Если НЕ Рез.Следующий() Тогда
				Возврат 0;
			КонецЕсли;
			
			сум = Рез.Всего_ВалютаОстаток;
			
		ИначеЕсли ТипЗнч(Док) = Тип("ДокументСсылка.CW_ДоходыПоГрузоперевозке") Тогда	
			Запрос = Новый Запрос;
			Запрос.Текст =
				"ВЫБРАТЬ
				|	CW_ОперативнаяДебиторскаяЗадолженностьОстатки.Всего_ВалютаОстаток
				|ИЗ
				|	РегистрНакопления.CW_ОперативнаяДебиторскаяЗадолженность.Остатки(, Счет = &Док) КАК CW_ОперативнаяДебиторскаяЗадолженностьОстатки";
			Запрос.УстановитьПараметр("НаДату", Док.Дата); 	
			Запрос.УстановитьПараметр("Док", Док);
			Рез = Запрос.Выполнить().Выбрать();
			Если НЕ Рез.Следующий() Тогда
				Возврат 0;
			КонецЕсли;
			
			сум = Рез.Всего_ВалютаОстаток;
			
		КонецЕсли;	
		
	КонецЕсли;	
	
	//Выводить сальдо по (0) грузоперевозке (1) документу расчетов
	Если ВыводЗадолженности = 0 Тогда 
		Если Док.СуммаДокумента <> 0 Тогда
			// посчитаем сумму услуг документа по выбранным г/п
			СуммаУслуг = 0;
			ТаблицаУслуг = Док.Услуги.Выгрузить();
			Для Каждого Стр Из Грузоперевозки Цикл
				Отбор = _сф.ст_Отбор("Грузоперевозка", Стр.Значение);
				_сф.Инкремент(СуммаУслуг, ТаблицаУслуг.Скопировать(Отбор, "Всего").Итог("Всего"));
			КонецЦикла; 
			сум = сум * СуммаУслуг / Док.СуммаДокумента;
		КонецЕсли;
	КонецЕсли;
	
	Возврат сум;
	
КонецФункции

// ---

&НаСервере
Процедура ПриСохраненииПользовательскихНастроекНаСервере(Настройки)
	
	Настройки.ДополнительныеСвойства.Вставить("Организация", Организация);
	Настройки.ДополнительныеСвойства.Вставить("ФормированиеОтчета", ОтображениеФинРез);
	Настройки.ДополнительныеСвойства.Вставить("ПорядокОтражения", ПорядокОтражения);
	Настройки.ДополнительныеСвойства.Вставить("ВыводЗадолженности", ВыводЗадолженности);
	//Настройки.ДополнительныеСвойства.Вставить("Грузоперевозки", Грузоперевозки);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеПользовательскихНастроекНаСервере(Настройки)
	
	Если НЕ СформироватьПриОткрытии Тогда
		CW_Отчеты.ПриЗагрузкеПользовательскихНастроекНаСервере(ЭтаФорма, Настройки);
	КонецЕсли;	
		
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьГрузоперевозки(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗакрытияФормыВыбораГрузоперевозок",ЭтаФорма);
	ПараметрыФормы = Новый Структура("МножественныйВыбор,ЗакрыватьПриВыборе,РежимВыбора", Истина, Истина, Истина);
	ОткрытьФорму("Справочник.CW_Грузоперевозки.ФормаВыбора",ПараметрыФормы,ЭтаФорма,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияФормыВыбораГрузоперевозок(РезультатВыбора, ДопПараметры) Экспорт
	
	Если Не РезультатВыбора = Неопределено Тогда
		
		Для Каждого ЗначениеВыбора из РезультатВыбора Цикл
			
			Если Грузоперевозки.НайтиПоЗначению(ЗначениеВыбора) = Неопределено Тогда
				Грузоперевозки.Добавить(ЗначениеВыбора);
			КонецЕсли;

		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьГрузоперевозки(Команда)
	
	Грузоперевозки.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборГрузоперевозокПоТексту(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаИзмененияОтбораПоТексту", ЭтотОбъект);
	
	ПараметрыФормы  = Новый Структура;
	ПараметрыФормы.Вставить("ОбъектСсылка", Неопределено);
	
	ОткрытьФорму("ОбщаяФорма.CW_ЖурналГрузоперевозок_ОтборКонтейнеровПоТексту",ПараметрыФормы, ЭтаФорма,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры    

&НаКлиенте
Процедура ОбработкаИзмененияОтбораПоТексту(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если РезультатВыбора.Свойство("НастройкиОтбора") Тогда 
		Для Каждого ЗначениеВМассиве из РезультатВыбора.НастройкиОтбора Цикл
			Если Грузоперевозки.НайтиПоЗначению(ЗначениеВМассиве) = Неопределено Тогда
				Грузоперевозки.Добавить(ЗначениеВМассиве);	
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры


//Работа с буфером обмена
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ДанныеСкопированыВБуферОбмена" Тогда
		УстановитьДоступностьКомандыВставки(ЭтотОбъект, Истина);
	КонецЕсли;

КонецПроцедуры  

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступностьКомандыВставки(Форма, Доступность)

	Доступность = Не Форма.ТолькоПросмотр И Доступность;
	Элементы = Форма.Элементы;
	Элементы.КомандаБуфераОбменаВставить.Доступность = Доступность;
	
КонецПроцедуры  

&НаКлиенте
Процедура БуфераОбменаВставить(Команда)
	КоличествоСтрок = БуфераОбменаВставитьНаСервере();
	Если КоличествоСтрок <> Неопределено Тогда
		CW_РаботаСБуферомОбменаКлиент.ОповеститьОВставкеСтрокИзБуфераОбмена(ЭтаФорма, КоличествоСтрок);	
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Функция БуфераОбменаВставитьНаСервере()
	
	ДанныеБуфераОбмена 	= CW_РаботаСБуферомОбмена.СтрокиИзБуфераОбмена(); 
	ТипИсточника		= CW_РаботаСБуферомОбмена.ПолучитьТипОбъектаПоИмени(ДанныеБуфераОбмена.Источник); 
	Если ТипИсточника <> тип("СправочникСсылка.CW_Грузоперевозки") Тогда
		Возврат Неопределено;
	КонецЕсли;   
	
	Грузоперевозки.ЗагрузитьЗначения(ДанныеБуфераОбмена.Данные);
	
	Возврат ДанныеБуфераОбмена.Данные.Количество();

КонецФункции
//Работа с буфером обмена
